# Referenties

Altijd beginnen met 'getting started':

https://pandas.pydata.org/docs/getting_started/index.html#getting-started

Dan een snel overzicht:

https://pandas.pydata.org/docs/user_guide/10min.html

Daarna kijken naar de API beschrijving:

https://pandas.pydata.org/docs/reference/index.html

# Installatie

Run `pip3 install pandas` in the terminal to install the Pandas library.

# Imports

In [1]:
import pandas as pd

import matplotlib.pyplot as plt

# Schetsen

In [47]:
# Dataframe maken
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [
            22,
            35,
            58
        ],
        "Sex": [
            "male",
            "male",
            "female"
        ],
    }
)

# Standaard print
print(df)

# Vergelijk met
display(df)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [38]:
# Data opslaan
df.to_csv('./output/persons.csv', header=True, index=False)

In [39]:
# Data inlezen
df_saved = pd.read_csv('./output/persons.csv')

df_saved

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [40]:
# De kolomnaam
df.columns

Index(['Name', 'Age', 'Sex'], dtype='object')

In [42]:
# Een kolom lezen
display(df['Age'])
display(df.Age)

0    22
1    35
2    58
Name: Age, dtype: int64

0    22
1    35
2    58
Name: Age, dtype: int64

In [49]:
# Een kolom verwijderen
df_copy = df.copy()
# display(df_copy.pop('Age'))
# display(df)
df_copy.drop('Age', axis=1, inplace=True)
# display(df)

In [50]:
# Een rij lezen
df.iloc[0]

Name    Braund, Mr. Owen Harris
Age                          22
Sex                        male
Name: 0, dtype: object

In [51]:
# Functie getRow() maken
def getRow(df, index):
    return df.iloc[index]

getRow(df, 1)

Name    Allen, Mr. William Henry
Age                           35
Sex                         male
Name: 1, dtype: object

In [57]:
# Een rij toevoegen
df_copy = df.copy()
df_copy.loc[4] = ['Elmer', 37, 'male']
df_copy

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female
4                     Elmer   37    male

In [134]:
# Verkennen
# ...

In [62]:
# Filteren
display(df[df['Age'] > 30])
display(df.loc[(df['Age'] > 30) & (df['Sex'] == 'male')])
display(df.query("Age > 30 and Sex == 'male'"))

                       Name  Age     Sex
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female
4                     Elmer   37    male

                       Name  Age   Sex
1  Allen, Mr. William Henry   35  male
4                     Elmer   37  male

                       Name  Age   Sex
1  Allen, Mr. William Henry   35  male
4                     Elmer   37  male

In [136]:
# Groeperen
# ...

In [137]:
# Extra: toepassing OOP en het bouwen van je eigen library
# ...